In [1]:
import pandas as pd

1. Given a sample list, tuple and a set with elements as nnumbers from 1-10. Convert each of the data types into a pandas series. Create a seperate list of index values for the series

In [5]:
list1 = list(range(1,11))
tuple1 = tuple(range(1,11))
set1 = set(range(1,11))

i = list(range(101,111))

ser_list = pd.Series(list1, index = i)
ser_tuple = pd.Series(tuple1, index = i)
ser_set = pd.Series(list(set1), index = i)

print(ser_list)
print(ser_tuple)
print(ser_set)

101     1
102     2
103     3
104     4
105     5
106     6
107     7
108     8
109     9
110    10
dtype: int64
101     1
102     2
103     3
104     4
105     5
106     6
107     7
108     8
109     9
110    10
dtype: int64
101     1
102     2
103     3
104     4
105     5
106     6
107     7
108     8
109     9
110    10
dtype: int64

2. Create a Python Dictionary with three key value pairs. Keep the keys as the first names and the respective last names as the values in the dictionary. Use the dictioinary to create pandas series

In [10]:
dict1 = {'Karan':'Swami', 'Khushi': 'Swami', 'Vaibhav': 'Swami'}
print(dict1)
ser_dict1 = pd.Series(dict1)
print(ser_dict1)

{'Karan': 'Swami', 'Khushi': 'Swami', 'Vaibhav': 'Swami'}
Karan      Swami
Khushi     Swami
Vaibhav    Swami
dtype: object

3. Create a pandas series, witht he elemnets as numbers from 1-10. Use Index values starting from 0-10. For the above series:
   1. Convert it to a list.
   2. Convert it into a dictionary.
   3. Convert it into a tuple.
   4. Convert it into a Set.

In [25]:
ser1 = pd.Series(range(1,11))
print(f'Series is: ')
print(ser1)

# Converting into a list
# list_ser = list(ser1)
list_ser = ser1.tolist()
print(f'List is: {list_ser}')

print('------------------------------------------------------------------------------------------')

# Converting it into a Dictionary
# dict_ser = dict(ser1)
dict_ser = ser1.to_dict()
print(f'Dictionary is: {dict_ser}')

print('------------------------------------------------------------------------------------------')

# Converting it into a Tuple
tuple_ser = tuple(ser1)
print(f'Tuple is: {tuple_ser}')

print('------------------------------------------------------------------------------------------')

# Converting it into a set
set_ser = set(ser1)
print(f'Set is: {set_ser}')

Series is:
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
List is: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
------------------------------------------------------------------------------------------
Dictionary is: {0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}
------------------------------------------------------------------------------------------
Tuple is: (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
------------------------------------------------------------------------------------------
Set is: {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

4. Create a sample pandas series with x integer elements.
   Perform the following operations on the same.
   1. Print the first 5 elements of the Series.
   2. Print the last 5 elements of the Series.
   3. Insert an integer value '50' at the index 5.
   4. Update the last element in the series with the value 100.
   5. Delete the first element of the Series.

Note:- The index values must not be affected by the operations and should be uniform for the series after the last operation.

In [43]:
s = pd.Series(range(1,21))
print(f' Series: ')
print(s)

 Series:
0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
dtype: int64

In [44]:
# First 5 elements
print('First 5 elements are: ')
print(s.head())

# Last 5 elements
print('Last 5 elements are: ')
print(s.tail())

# Inserting value 50 at index 5
print('Inserting value: ')
s[5] = 50
print(s)

# Updating last element
print('Updating last element: ')
s[-1:] = 100
print(s)

# Deleting first element from the series
print('Deleting first element: ')
z = s.drop(0)
print(z)

First 5 elements are:
0    1
1    2
2    3
3    4
4    5
dtype: int64
Last 5 elements are:
15    16
16    17
17    18
18    19
19    20
dtype: int64
Inserting value:
0      1
1      2
2      3
3      4
4      5
5     50
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
dtype: int64
Updating last element:
0       1
1       2
2       3
3       4
4       5
5      50
6       7
7       8
8       9
9      10
10     11
11     12
12     13
13     14
14     15
15     16
16     17
17     18
18     19
19    100
dtype: int64
Deleting first element:
1       2
2       3
3       4
4       5
5      50
6       7
7       8
8       9
9      10
10     11
11     12
12     13
13     14
14     15
15     16
16     17
17     18
18     19
19    100
dtype: int64

5. Write a program to find 100 in the list created in the 4 sub-part of the previous question

In [51]:
if 100 in z.values:
    print('Found 100')
else:
    print('Not Found')

Found 100

6. For the given series A and B, perform concatenation on the same.
    - series_A = pd.Series([1,2,3,4,5])
    - series_B = pd.Series([6,7,8,9,10])

In [64]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])

ts = pd.concat([series_A, series_B], ignore_index = True)
print(ts)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

7. Using loops in python, print all the elements within a pandas series. 
    Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [65]:
sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

for i in sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

8. For a given nested List and a sample dictionary, create two data frames using pandas. List = [['AA','BB','CC'],['DD','EE','FF'],['GG','HH','II']] Dictionary = {'Kris': ['Jordan', 12, 22], 'Memphis': ['Depay', 23, 24]}

In [68]:
l = [['AA','BB','CC'],['DD','EE','FF'],['GG','HH','II']]
d = {'Kris': ['Jordan', 12, 22], 'Memphis': ['Depay', 23, 24]}

l_d = pd.DataFrame(l)
print(l_d)
print('--------------------------------------')
d_d = pd.DataFrame(d)
print(d_d)

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II
--------------------------------------
     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

9. Create a pandas DataFrame with two columns  = {'Name', 'Age'}.
    Perform the following:
   1. Print the first 3 rows of the dataframe
   2. Print the rows that have the age greater than 13
   3. Insert 5 imaginary names and ages as the values to the pandas DataFrame
   4. Update the 5th row so that the name = jhon and age = 56
   5. Delete the first row from the DataFrame

In [76]:
df = pd.DataFrame({'Name':['Rohan','Taran','Tanishq','Sumit','Rithwik','Aryaman','Jatin'], 
                   'Age': [22,21,14,25,26,28,20]})
df

      Name  Age
0    Rohan   22
1    Taran   21
2  Tanishq   14
3    Sumit   25
4  Rithwik   26
5  Aryaman   28
6    Jatin   20

In [77]:
df.head(3)

      Name  Age
0    Rohan   22
1    Taran   21
2  Tanishq   14

In [78]:
print(df[df['Age'] > 15])

      Name  Age
0    Rohan   22
1    Taran   21
3    Sumit   25
4  Rithwik   26
5  Aryaman   28
6    Jatin   20

In [79]:
new_data = pd.DataFrame({
    'Name': ['Kuldeep','Grace','Mathew','Wizzy','Jack'],
    'Age': [25, 17, 19, 21, 23]
})

new_data

      Name  Age
0  Kuldeep   25
1    Grace   17
2   Mathew   19
3    Wizzy   21
4     Jack   23

In [80]:
df_new = pd.concat([df, new_data], ignore_index = True)
df_new

       Name  Age
0     Rohan   22
1     Taran   21
2   Tanishq   14
3     Sumit   25
4   Rithwik   26
5   Aryaman   28
6     Jatin   20
7   Kuldeep   25
8     Grace   17
9    Mathew   19
10    Wizzy   21
11     Jack   23

In [81]:
df_new.loc[4, 'Name'] = 'Jhon'
df_new.loc[4, 'Age'] = 56
df_new

       Name  Age
0     Rohan   22
1     Taran   21
2   Tanishq   14
3     Sumit   25
4      Jhon   56
5   Aryaman   28
6     Jatin   20
7   Kuldeep   25
8     Grace   17
9    Mathew   19
10    Wizzy   21
11     Jack   23

In [82]:
df_new = df_new.drop(0)
df_new

       Name  Age
1     Taran   21
2   Tanishq   14
3     Sumit   25
4      Jhon   56
5   Aryaman   28
6     Jatin   20
7   Kuldeep   25
8     Grace   17
9    Mathew   19
10    Wizzy   21
11     Jack   23

10. Create a dataframe with columns Name and Age. Perform the following operations:
    1. Write a sample code to search for the Name/Names where age is 20.
    2. Dort the DataFrame in ascending order of ages.
    3. Using pyhton loops, print the ages from the DataFrame and store it in a set

In [83]:
x = pd.DataFrame({
    'Name': ['Dhoni','Virat','Hardik','David','Rahul'],
    'Age': [43, 20, 27, 35, 28]
})
x

     Name  Age
0   Dhoni   43
1   Virat   20
2  Hardik   27
3   David   35
4   Rahul   28

In [86]:
print(x[x['Age'] == 20])

    Name  Age
1  Virat   20

In [87]:
print(x.sort_values('Age'))

     Name  Age
1   Virat   20
2  Hardik   27
4   Rahul   28
3   David   35
0   Dhoni   43

In [88]:
y = set()

for a in x['Age']:
    print(a)
    y.add(a)
print(y)

43
20
27
35
28
{35, 43, 20, 27, 28}